const questions = [
    {
        type: 'checkbox',
        question: 'Предмет для подготовки:',
        options: [
            'Русский язык',
            'Литература',
            'История',
            'Обществознание',
            'Математика (базовая)',
            'Математика (профильная)',
            'Физика',
            'Химия',
            'Биология',
            'Информатика',
            'География'
        ]
    },
    // {
    //     type: 'text',
    //     question: 'Какая профессия осваивается:'
    // },
    {
        type: 'checkbox',
        question: 'Опыт преподавателя:',
        options: [
            '1-3 года',
            '3-5 лет',
            '5-7 лет',
            '7 и более'
        ]
    },
    {
        type: 'text',
        question: 'Желаемые баллы для поступления (минимальный и максимальный порог, например, 60-70):'
    },
    {
        type: 'checkbox',
        question: 'Приоритет в обучении:',
        options: [
            'Высокий балл',
            'Общее развитие',
            'Психологический комфорт',
            'Крепкие теоретические знания',
            'Разнообразие практического материала'
        ]
    },
    {
        type: 'radio',
        question: 'Вид запоминания информации:',
        options: [
            'Образное (визуал)',
            'Двигательное (кинестетик)',
            'Эмоциональное',
            'Словесно-логическое (аудиал/дигитал)',
            'Я не знаю (пройти тестирование)'
        ]
    },
    {
        type: 'radio',
        question: 'Стиль обучения:',
        options: [
            'Деятель',
            'Мыслитель',
            'Теоретик',
            'Прагматик',
            'Я не знаю (пройти тестирование)'
        ]
    },
    {
        type: 'radio',
        question: 'Темперамент:',
        options: [
            'Холерик',
            'Сангвиник',
            'Меланхолик',
            'Флегматик',
            'Я не знаю (пройти тестирование)'
        ]
    },
    {
        type: 'checkbox',
        question: 'Личностные качества (выбрать 3 качества):',
        options: [
            'Коммуникабельность',
            'Отзывчивость',
            'Пунктуальность',
            'Решимость',
            'Самокритичность',
            'Смелость',
            'Справедливость',
            'Толерантность',
            'Трудолюбие',
            'Уважение к другим',
            'Уверенность',
            'Упорство',
            'Честность',
            'Чувство собственного достоинства',
            'Чувство юмора',
            'Щедрость'
        ]
    },
    {
        type: 'checkbox',
        question: 'Увлечения:',
        options: [
            'Спорт',
            'Художественное искусство',
            'Музыкальное искусство',
            'Прикладное искусство',
            'Киноискусство/мультипликация',
            'Танцы',
            'Моделирование и программирование',
            'Биологические исследования',
            'Медицина',
            'Зоология',
            'Космос',
            'Мода',
            'Бизнес',
            'Менеджмент и управление'
        ]
    }
];