const questions = [
    {
        type: 'checkbox',
        question: 'Приоритет в обучении:',
        options: [
            'Высокий балл',
            'Общее развитие',
            'Психологический комфорт',
            'Крепкие теоретические знания',
            'Разнообразие практического материала'
        ]
    },
    {
        type: 'radio',
        question: 'Вид преподавания информации:',
        options: [
            'Образное (визуал)',
            'Двигательное (кинестетик)',
            'Эмоциональное',
            'Словесно-логическое (аудиал/дигитал)',
            'Я не знаю (пройти тестирование)'
        ]
    },
    {
        type: 'radio',
        question: 'Стиль обучения:',
        options: [
            'Деятель',
            'Мыслитель',
            'Теоретик',
            'Прагматик',
            'Я не знаю (пройти тестирование. Авторы: П. Хани и А. Мамфорд)'
        ]
    },
    {
        type: 'radio',
        question: 'Темперамент:',
        options: [
            'Холерик',
            'Сангвиник',
            'Меланхолик',
            'Флегматик',
            'Я не знаю (пройти тестирование. Авторы: Г. В. Резапкина; Hans Eysenck)'
        ]
    },
    {
        type: 'checkbox',
        question: 'Личностные качества (выбрать 3 качества):',
        options: [
            'Коммуникабельность',
            'Отзывчивость',
            'Пунктуальность',
            'Решимость',
            'Самокритичность',
            'Смелость',
            'Справедливость',
            'Толерантность',
            'Трудолюбие',
            'Уважение к другим',
            'Уверенность',
            'Упорство',
            'Честность',
            'Чувство собственного достоинства',
            'Чувство юмора',
            'Щедрость'
        ]
    },
    {
        type: 'checkbox',
        question: 'Увлечения:',
        options: [
            'Спорт',
            'Художественное искусство',
            'Музыкальное искусство',
            'Прикладное искусство',
            'Киноискусство/мультипликация',
            'Танцы',
            'Моделирование и программирование',
            'Биологические исследования',
            'Медицина',
            'Зоология',
            'Космос',
            'Мода',
            'Бизнес',
            'Менеджмент и управление'
        ]
    }
];